Repository: 84000/data-translation-memory
Catalog: toh671-v3.tmx
Source language: bo
Languages: en

source: མ་རྣམས་ནང་ན་ཁྱོད་ནི་རྟག་ཏུ་མཆོག་ཡིན་ཏེ། །འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ཁྱོད་ལ་བསྟོད། །བྱད་བཞིན་སྡུག་མཛེས་ཀུན་གྱིས་བལྟ་བར་མོས། །
en: “You have always been supreme among mothers, The entire triple world praises you, And everyone longs to see your beautiful face.

source: ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་ལུས་རབ་བརྒྱན། །
en: Your body is adorned with various wonderful features.

source: མིག་ཡངས་འདམ་སྐྱེས་སྔོན་པོའི་འདབ་མ་འདྲ། །བསོད་ནམས་ཡེ་ཤེས་སྣང་བ་གྲགས་པས་བརྒྱན། །དཔེར་ན་རིན་ཐང་མེད་པའི་ནོར་བུ་འདྲ། །
en: “Your eyes are broad like the petals of a blue lotus, You are adorned with the famous light of merit and wisdom, And you are just like a priceless jewel.

source: དེང་བདག་པདྨོ་ཁྱོད་ལ་བསྔགས་པས་ཀྱང་། །སེམས་ལ་བསམ་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། །
en: Because I have praised you now, Lotus lady, My mind’s every wish will be fulfilled.

source: ཡང་དག་ཡེ་ཤེས་གྱ་ནོམ་བཀྲ་ཤིས་པ། །
en: “Your wisdom is perfect and your good fortune abundant.

source: པདྨ་ལྟ་བུར་ཤིན་ཏུ་རྣམ་པར་དག །ལུས་མདོག་རབ་མཛེས་ཀུན་གྱིས་ལྟ་བར་མོས། །
en: You are perfectly pure like a lotus And all long to see your body’s beautiful hue.

source: མཚན་མ་ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་བརྒྱན། །
en: You are adorned with various marks and features.

source: དྲི་མེད་ཡེ་ཤེས་ཀུན་ཏུ་རབ་མཛེས་པ། །དྲན་པ་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་གྱུར། །ཅི་ལྟར་སེང་གེ་གཅན་གཟན་མཆོག་གྱུར་བཞིན། །
en: “You are beautified by your stainless wisdom, Are supreme among all objects of recollection, And, like a lion, are supreme among predators.

source: བསྔགས་བསྟོད་ཚིག་ནི་འདི་ལས་འབྱུང་བ་ཡིས། །བསམ་པའི་དངོས་པོ་ཐམས་ཅད་གྲུབ་པར་ཤོག །ཅེས་བསྟོད་དོ། །
en: “As a result of these verses of praise, May all that is desired be attained.”

source: དེ་ནས་དཔལ་ཕྱག་ན་རྡོ་རྗེས་འདུས་པ་རྣམས་ལ་བཀའ་སྩལ་པ། ཁྱེད་ཀྱིས་དཔལ་ལྷ་མོ་ལ་བསྟོད་པ་ལེགས་སོ། །
en: Then, glorious Vajrapāṇi addressed the gathering: “Your praises to Śrīdevī are wonderful.

source: ང་ཡང་བསྟོད་པ་འདི་དག་གི་དོན་སྒོམས་ཤིག །ཡིད་ལ་རྟག་ཏུ་ཟློས་ཅིག །
en: I too will reflect on the meaning of these praises and constantly recite them mentally.

source: ལྷ་མོ་འདི་ལ་བསྟོད་པ་ནི་ང་ལ་བསྟོད་པ་ཡིན་ནོ། །སངས་རྒྱས་ཐམས་ཅད་ལ་བསྟོད་པ་ཡིན་ནོ། །
en: To praise this goddess is to praise me and to praise all the buddhas.

source: ལྷ་མོ་དེས་ཀྱང་མི་འདི་སྲུང་བར་བྱེད་དོ། །སྐྱོབ་པར་བྱེད་དོ། །ཅི་འདོད་པའི་དངོས་གྲུབ་སྟེར་རོ་ཞེས་བཀའ་སྩལ་པ་དང་།
en: The goddess protects and defends such a person and grants whatever accomplishments they desire.”

source: འཁོར་དེ་རྣམས་རབ་ཏུ་དགའ་ནས་བཅོམ་ལྡན་འདས་ཕྱག་ན་རྡོ་རྗེ་ལ་རྒྱན་གྱི་ཆར་ཆེན་པོ་ཕབ་ནས་སོ་སོའི་གནས་སུ་འཁོད་དོ། །
en: When he finished speaking, the assembly was delighted and a great torrent of ornaments rained down on blessed Vajrapāṇi. They then returned to their respective abodes.

source: བསྟོད་པའི་རྒྱལ་པོའི་རྒྱུད་རྫོགས་སོ།།
en: This concludes “The Sovereign Tantra of Praises.”
